In [1]:
import pandas as pd
Nov_df=pd.read_excel('all_data.xlsx',sheet_name='ALL')
Nov_df.head()

  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
0       東京支店  N社  10830  2150     1540
1      名古屋支店  N社   7690  1650     2150
2       大阪支店  N社   9850  1840     1280
3       東京支店  P社  12580  3200     2850
4      名古屋支店  P社  10950  2100     2280

In [2]:
Nov_df.iloc[0,0]

'東京支店'

In [3]:
Nov_df.dtypes#データ型を調べる

Unnamed: 0    object
企業名           object
パソコン           int64
プリンタ           int64
デジタルカメラ        int64
dtype: object

In [4]:
sales=Nov_df['パソコン'[:5]] #金額の列の値抽出最初の5行を指定して抽出。データ型がDataFrameではなく、Seriesになってしまいます
sales

0    10830
1     7690
2     9850
3    12580
4    10950
5    12450
6    11250
7     9500
8    13450
Name: パソコン, dtype: int64

In [5]:
#Nov_df[['パソコン']][:5]#DataFrameを使用して最初の５行抽出
Nov_df[['企業名','プリンタ']][:5]
Nov_df[['企業名','プリンタ']][:]

  企業名  プリンタ
0  N社  2150
1  N社  1650
2  N社  1840
3  P社  3200
4  P社  2100
5  P社  2850
6  D社  2500
7  D社  1750
8  D社  3250

In [6]:
columns=Nov_df.iloc[0,[0,1,2,3,4]]
columns

Unnamed: 0     東京支店
企業名              N社
パソコン          10830
プリンタ           2150
デジタルカメラ        1540
Name: 0, dtype: object

In [7]:
Nov_df['企業名'] == 'N社' #条件指定

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
Name: 企業名, dtype: bool

In [8]:
Nov_df[Nov_df['企業名'] == 'N社']#条件抽出

  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
0       東京支店  N社  10830  2150     1540
1      名古屋支店  N社   7690  1650     2150
2       大阪支店  N社   9850  1840     1280

In [9]:
#Nov_df['日付'] == 2015-4-5 #And Nov_df['お得意先'] == '長野文具販売'
#Nov_df.query('お得意先 == "長野文具販売" & 日付=="2015-04-05"') #アポストロフィーの位置注意　複数条件

In [10]:
Nov_df.describe()

               パソコン         プリンタ      デジタルカメラ
count      9.000000     9.000000     9.000000
mean   10950.000000  2365.555556  2131.111111
std     1774.873235   613.944442   492.961572
min     7690.000000  1650.000000  1280.000000
25%     9850.000000  1840.000000  1950.000000
50%    10950.000000  2150.000000  2150.000000
75%    12450.000000  2850.000000  2480.000000
max    13450.000000  3250.000000  2850.000000

In [11]:
companies =Nov_df['企業名'].unique()
companies

array(['N社', 'P社', 'D社'], dtype=object)

In [12]:
companies[0]

'N社'

In [13]:
nu = Nov_df['企業名'].nunique()
nu

3

In [14]:
for company in companies:
    print(company)
    
    div_sale=Nov_df.query('企業名 == @company')#query()メソッドの中では、そのまま変数を使うことができません。query()メソッドの中での条件文字列の中で変数を使用するには、変数名の前に＠をつける必要があります。
    print(div_sale)
print(companies[0])

N社
  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
0       東京支店  N社  10830  2150     1540
1      名古屋支店  N社   7690  1650     2150
2       大阪支店  N社   9850  1840     1280
P社
  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
3       東京支店  P社  12580  3200     2850
4      名古屋支店  P社  10950  2100     2280
5       大阪支店  P社  12450  2850     2480
D社
  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
6       東京支店  D社  11250  2500     2100
7      名古屋支店  D社   9500  1750     1950
8       大阪支店  D社  13450  3250     2550
N社

In [15]:
import openpyxl
import glob
wb = openpyxl.Workbook()#新規ファイル作成

sheet = wb.active
wbnew=wb.create_sheet(title = company, index=1)
wb.save('test2.xlsx')
glob.glob("*.xlsx")

['alltest2.xlsx',
 'all_data - コピー.xlsx',
 'all_data.xlsx',
 'sample.xlsx',
 'test.xlsx',
 'test2.xlsx']

In [28]:
#import openpyxl　#OK　企業別のシート追加、値転機まだ。
from openpyxl.utils.dataframe import dataframe_to_rows
#rows = dataframe_to_rows(p)
wb = openpyxl.Workbook()#新規ファイル作成

wb.save('alltest2.xlsx')


wb.create_sheet(title = 'N社', index=1)#企業別シート追加OK
data=Nov_df[Nov_df['企業名'] == 'N社']
df=pd.DataFrame(data)
print(df)
data.to_excel('alltest2.xlsx',sheet_name='N社')

print(wb.sheetnames)

#print(companies[0])
    

#wb.save('alltest2.xlsx')

  Unnamed: 0 企業名   パソコン  プリンタ  デジタルカメラ
0       東京支店  N社  10830  2150     1540
1      名古屋支店  N社   7690  1650     2150
2       大阪支店  N社   9850  1840     1280
['Sheet', 'N社']

In [36]:
#import openpyxl　#OK　企業別のシート追加、値OK!!!
from openpyxl.utils.dataframe import dataframe_to_rows
#rows = dataframe_to_rows(p)
wb = openpyxl.Workbook()#新規ファイル作成

wb.save('alltest3.xlsx')
for company in companies:
    #print(company)
    wb.create_sheet(title = company, index=1)#企業別シート追加OK
    data=Nov_df[Nov_df['企業名'] == company]
    df=pd.DataFrame(data)
    #print(df)
    
    with pd.ExcelWriter('alltest3.xlsx', engine="openpyxl", mode="a") as writer: #こちらのファイルに書き出し、追加書き出し
        
        data.to_excel(writer, sheet_name=company, index=False)    #シート名を指定
     
    #data.to_excel('alltest3.xlsx',sheet_name=company)
print(wb.sheetnames)


#print(companies[0])
    

#wb.save('alltest3.xlsx')

['Sheet', 'D社', 'P社', 'N社']